/* failure reason */
"Background colors must be specified as comma-delimited RGB floats (e.g., “0.5,0.0,1.0”)" = "Background colors must be specified as comma-delimited RGB floats (e.g., “0.5,0.0,1.0”)";

/* error */
"Bad response from net request" = "Bad response from net request";

/* recovery suggestion */
"Check the formatting of your background color" = "Check the formatting of your background color";

/* recovery suggestion */
"Check the URL to make sure it is working properly." = "Check the URL to make sure it is working properly.";

/* failure reason */
"Core Image couldn’t parse the image file." = "Core Image couldn’t parse the image file.";

/* error */
"Couldn’t load image" = "Couldn’t load image";

/* error */
"Couldn’t resize image" = "Couldn’t resize image";

/* error */
"Invalid background color" = "Invalid background color";

/* error */
"Invalid URL: %@" = "Invalid URL: %@";

/* recovery suggestion */
"Make sure you are specifying the complete URL, including the scheme." = "Make sure you are specifying the complete URL, including the scheme.";

/* error */
"No such file: %@" = "No such file: %@";

/* failure reason */
"Non-successful HTTP response code %d." = "Non-successful HTTP response code %d.";

/* failure reason */
"Response was not recognized as an HTTP response." = "Response was not recognized as an HTTP response.";

/* failure reason */
"That URL couldn’t be parsed." = "That URL couldn’t be parsed.";

/* failure reason */
"The resize parameter may have been invalid." = "The resize parameter may have been invalid.";

/* failure reason */
"There is no file at that location." = "There is no file at that location.";

/* recovery suggestion */
"Try using a different resize parameter." = "Try using a different resize parameter.";

/* recovery suggestion */
"Verify that the file is a supported image type." = "Verify that the file is a supported image type.";

/* recovery suggestion */
"Verify that the image file exists at that location." = "Verify that the image file exists at that location.";

